In [16]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass 

password = getpass.getpass()

········

In [22]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/bank'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM sakila.film_actor', engine)
data.head()

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03
2         1       25 2006-02-15 05:05:03
3         1      106 2006-02-15 05:05:03
4         1      140 2006-02-15 05:05:03

In [23]:
# How many distinct (different) actors' last names are there?
dataactor = data['actor_id'].value_counts()

In [24]:
# therefore 200 different actors
dataactor.shape

(200,)

In [25]:
#second way of doing that!!
query = '''SELECT COUNT(DISTINCT actor_id) FROM sakila.film_actor;'''
data2 = pd.read_sql_query(query, engine)
print(data2)

   COUNT(DISTINCT actor_id)
0                       200

In [41]:
#Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week. For 
query = '''SELECT rental_date,
CASE
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sat' then 'weekend'
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sun' then 'weekend'
ELSE 'weekday'
END AS column_day_type
FROM sakila.rental;'''

data2 = pd.read_sql_query(query, engine)
data2.head()

          rental_date column_day_type
0 2005-05-24 22:53:30         weekday
1 2005-05-24 22:54:33         weekday
2 2005-05-24 23:03:39         weekday
3 2005-05-24 23:04:41         weekday
4 2005-05-24 23:05:21         weekday

In [31]:
#Get all films with ARMAGEDDON in the title.
query2 = '''SELECT title FROM sakila.film 
WHERE title LIKE '%%ARMAGEDDON%%';'''
data3 = pd.read_sql_query(query2, engine)
print(data3)

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

In [34]:
#Get 10 the longest films.
query3 = '''SELECT length, title from sakila.film order by length desc
limit 10;'''
data4 = pd.read_sql_query(query3, engine)
print(data4)

   length               title
0     185      DARN FORRESTER
1     185        POND SEATTLE
2     185       CHICAGO NORTH
3     185       MUSCLE BRIGHT
4     185        WORST BANGER
5     185         GANGS PRIDE
6     185  SOLDIERS EVOLUTION
7     185           HOME PITY
8     185   SWEET BROTHERHOOD
9     185      CONTROL ANTHEM

In [39]:
#How many films include Behind the Scenes content?
query4 = '''SELECT COUNT(*) FROM sakila.film WHERE special_features LIKE '%%Behind the Scenes%%';'''
data5 = pd.read_sql_query(query4, engine)
print(data5)

   COUNT(*)
0       538

In [42]:
#Which kind of movies (rating) have a mean duration of more than two hours?
query5 = '''SELECT rating FROM sakila.film 
GROUP BY rating 
HAVING ROUND(AVG(length),2) > 120;'''
data6 = pd.read_sql_query(query5, engine)
print(data6)

  rating
0  PG-13

In [ ]:
#Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

query6 = '''SELECT title, length, RANK() OVER (ORDER BY length DESC) as Rank1 FROM film 
WHERE length IS NOT NULL AND length !=0 
ORDER BY length DESC;'''
data7 = pd.read_sql_query(query6, engine)
print(data7)